/*创建huazan数据库*/
SET NAMES UTF8;
DROP DATABASE IF EXISTS huazan;
CREATE DATABASE huazan CHARSET=UTF8;
USE huazan;

/*创建鲜花种类*/
CREATE TABLE hz_flower_family(
	id INT PRIMARY KEY AUTO_INCREMENT,
	fname VARCHAR(32)
);
/*创建商品表*/
CREATE TABLE hz_flower(
	id INT PRIMARY KEY AUTO_INCREMENT,
	family_id INT,                     #所属鲜花种类编号
	product_id VARCHAR(16),            #鲜花编号
	title VARCHAR(128),                #标题
	img VARCHAR(128),                  #图片
	price DECIMAL(8,2),				         #价格
	materials VARCHAR(128),			       #材料
	pack VARCHAR(32),                  #包装
	presenter VARCHAR(64),             #附赠
	distribu VARCHAR(32),              #配送
	explains VARCHAR(256),             #说明
	details VARCHAR(1024),             #商品详情
	save DECIMAL(8,2)                  #节省多少钱
);
/*用户信息*/
CREATE TABLE hz_user(
	id INT PRIMARY KEY AUTO_INCREMENT,
	uname VARCHAR(32),
	upwd VARCHAR(32),
	email VARCHAR(64),
	phone VARCHAR(16) NOT NULL UNIQUE,
	avatar VARCHAR(128),               #头像图片路径
	user_name VARCHAR(32),             #用户名，如王小明
	gender INT                         #性别  0-女  1-男
); 
/*收货地址信息表*/
CREATE TABLE hz_receiver_address(
	id INT PRIMARY KEY AUTO_INCREMENT,
	user_id INT,                       #用户编号
	receiver VARCHAR(16),              #接收人姓名
	province VARCHAR(16),              #省
	city VARCHAR(16),				           #市
	county VARCHAR(16),                #县
	address VARCHAR(128),              #详细地址
	cellphone VARCHAR(16),             #手机
	fixedphone VARCHAR(16),            #固定电话
	postcode CHAR(6),                  #邮编
	tag VARCHAR(16),                   #标签名
	is_default BOOLEAN                 #是否为当前用户的默认收货地址
);
/*购物车条目*/
CREATE TABLE hz_shopping_cart(
	id INT PRIMARY KEY AUTO_INCREMENT,
	user_id INT,                       #用户编号
	product_id INT,                    #商品编号
	count INT                          #购买数量
);
/*用户订单*/
CREATE TABLE hz_order(
	id INT PRIMARY KEY AUTO_INCREMENT,
	user_id INT,                       #用户编号
	address_id INT,                    #地址编号
	status INT,                        #订单状态  1-等待付款  2-等待发货  3-运输中  4-已签收  5-已取消
	order_time BIGINT,                 #下单时间
	pay_time BIGINT,                   #付款时间
	deliver_time BIGINT,               #发货时间
	received_time BIGINT               #签收时间
);
/*用户订单详情表*/
CREATE TABLE hz_order_detail(
 	id INT PRIMARY KEY AUTO_INCREMENT,
 	order_id INT,                      #订单编号
 	product_id INT,                    #产品编号
 	count INT                          #购买数量
 );
/*首页轮播图表*/
CREATE TABLE hz_index_carousel(
	id INT PRIMARY KEY AUTO_INCREMENT,
	img VARCHAR(128),                  #图片路径
	title VARCHAR(64),                 #图片描述
	href VARCHAR(128)                  #图片链接
);
/*首页商品表*/
CREATE TABLE hz_index_product(
	id INT PRIMARY KEY AUTO_INCREMENT,
	title VARCHAR(64),                 #商品标题
	pic VARCHAR(128),                  #图片
	price DECIMAL(10,2),               #商品价格
	href VARCHAR(128)                  #连接地址
);
/*花语文章列表分类*/
CREATE TABLE hz_huayu_category(
	id INT PRIMARY KEY AUTO_INCREMENT,
	category_name VARCHAR(64),         #分类名称
	category_info VARCHAR(64)          #标题信息
);
/*花语文章页*/
CREATE TABLE hz_huayu_articles(
	id INT PRIMARY KEY AUTO_INCREMENT,
	subject VARCHAR(64),                #文章标题
	timer VARCHAR(32),                  #发表时间
	description mediumtext,             #文章内容
	img VARCHAR(50),                    #显示图片
	category_id SMALLINT(5)             #分类id
);
/*插入基础数据*/
/*鲜花种类*/
INSERT INTO hz_flower_family VALUES(NULL,'鲜花'),
                                   (NULL,'进口鲜花'),
                                   (NULL,'生活鲜花'),
                                   (NULL,'开业花篮'),
                                   (NULL,'永生花'),
                                   (NULL,'礼品');
/*商品*/
INSERT INTO hz_flower VALUES(NULL,1,'RW000309','就是赖上你-19朵红玫瑰花束','/image/1.jpg',399,'19朵红玫瑰','黑色硬网纱+黑色雾面纸韩式包装，灰色缎带束扎。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材 的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="image/1.jpg" alt=""><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',40),
(NULL,1,'RW000346','留住好时光-33朵魅影玫瑰','/image/1559547449078861847.jpg',599,'33朵魅影玫瑰（紫玫瑰）。（请至少提前一天订购或订购前咨询客服）','白色雪梨纸+米色硬纸韩式包装，浅紫色缎带束扎。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/1559547449078861847.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',60),
(NULL,1,'RW000056','你的眼神-9朵香槟玫瑰+5支白色洋桔梗混搭','/image/1560160287_93552.jpg',599,'9朵香槟玫瑰，搭配5支白色洋桔梗、2支绿色小雏菊、适量尤加利叶装饰。','白色雪梨纸+浅绿色硬纸韩式包装，灰白罗文带束扎。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/1560160287_93552.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',60),
(NULL,1,'RW000056','醉相思-19朵红玫瑰','/image/index_floor1_right1.jpg',399,'9朵红玫瑰。','长方形礼盒装。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/index_floor1_right1.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',40),
(NULL,1,'RW000021','爱之物语-14朵红玫瑰','/image/1528953573769050383.jpg',499,'14朵红玫瑰，搭配适量龙柳、小彩灯装饰。','白色雾面纸韩式扇形包装，精美黑色英文丝带蝴蝶结束扎。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/1528953573769050383.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',50),
(NULL,1,'RW000031','回眸三生-33朵糖果雪山','/image/1529564009443021404.jpg',699,'33朵糖果雪山玫瑰。','精美抱抱桶包装。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/1529564009443021404.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',70),
(NULL,2,'RW000042','爱在巴黎-19朵甜心玫瑰','/image/1530173862_99122.jpg',1499,'19朵甜心玫瑰，搭配适量尤加利叶装饰','白色雾面纸韩式扇形包装，精美白色字母丝带+黑色丝带束扎。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','特别说明：本款为特别款进口鲜花，请至少提前1-3天预订，或订购前咨询客服。','<img src="/image/1530173862_99122.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',150),
(NULL,2,'RW000043','青春之歌-10朵甜心玫瑰','/image/1529914580016703144.jpg',1499,'10朵厄瓜多尔甜心玫瑰，搭配适量尤加利叶等装饰。','黑色雾面纸韩式扇形包装，精美黑色丝带束扎。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','特别说明：本款为特别款进口鲜花，请至少提前1-3天预订，或订购前咨询客服。','<img src="/image/1529914580016703144.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',150),
(NULL,2,'RW000083','悦动你心-19朵厄瓜多尔甜心玫瑰','/image/1537249720878833610.jpg',1799,'19朵厄瓜多尔甜心玫瑰。','精美长方形礼盒装。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','特别说明：本款为特别款进口鲜花，请至少提前1-3天预订，或订购前咨询客服。','<img src="/image/1537249720878833610.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',180),
(NULL,2,'RW000064','生命的主角-天空玫瑰韩式混搭','/image/1536285985858329282.jpg',1999,'9朵厄瓜多尔天空玫瑰、6朵白玫瑰、1朵蓝绣球，搭配适量绿叶等配花装饰。','白色雾面纸、蓝色雾面纸、灰色皮纹硬纸韩式包装，精美灰色丝带蝴蝶结束扎。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','特别说明：本款为特别款进口鲜花，请至少提前1-3天预订，或订购前咨询客服。','<img src="/image/1536285985858329282.jpg"><img src="image/1550468876_41813.jpg" alt=""> <img src="image/1550468876_27137.jpg" alt=""> <img src="image/1550468877_25529.jpg" alt="">',200),
(NULL,3,'RW000331','完美主义-6支跳舞兰（送花瓶）','/image/1550740351430764954.jpg',499,'6支跳舞兰','各城市花瓶款式略有差异，以当地实物为准。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/1550740351430764954.jpg">',50),
(NULL,3,'RW000333','爱丽丝梦境-5支浅黄色康乃馨+4支黄玫瑰+6支红玫瑰（送花瓶）','/image/1550740843295924331.jpg',399,'5支浅黄色康乃馨+4支黄玫瑰+6支红玫瑰，搭配适量栀子叶和适量黄莺装饰','各城市花瓶款式略有差异，以当地实物为准','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/1550740843295924331.jpg">',40),
(NULL,3,'RW000372','异域风情-进口花材混搭（送花瓶）','/image/1552959436785014519.jpg',799,'1支绿色绣球花+5支厄瓜多尔甜心玫瑰，搭配丰满白色澳洲腊梅、红色澳洲腊梅、红枫叶、相思豆装饰。','各城市花瓶款式略有差异，以当地实物为准','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','特别说明：本款为特别款进口鲜花，请至少提前1-3天预订，或订购前咨询客服。','<img src="/image/1552959436785014519.jpg">',80),
(NULL,3,'RW000330','星晴-5支香槟玫瑰+4支粉玫瑰+5支绿色康乃馨（送花瓶）','/image/1550740113983507013.jpg',390,'5支香槟玫瑰+4支粉玫瑰+5支绿色康乃馨，搭配适量蕾丝花、黄莺装饰','各城市花瓶款式略有差异，以当地实物为准','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于各地的花艺师不同，鲜花包扎可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢您的理解。','<img src="/image/1550740113983507013.jpg">',80),
(NULL,4,'RW000359','开业大吉','/image/359_1552619183_57205.jpg',458,'单个花篮','混色扶郎花65朵（红色扶郎花56朵，玫红色扶郎花9朵）、多头粉百合1支，搭配适量洋兰、巴西叶、散尾葵、栀子叶装饰。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于鲜花包扎各地的花艺师不同，可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢。','<img src="/image/359_1552619183_57205.jpg">',46),
(NULL,4,'RW000170','鸿运福星-网红气球开业花篮','/image/1546406377369935755.jpg',699,'单个花篮','马卡龙色气球（浅绿色、浅蓝色、白色、透明色）+蓝色绣球+白玫瑰+浅绿色洋桔梗，搭配适量龟背叶、散尾葵、尤加利叶装饰。','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于鲜花包扎各地的花艺师不同，可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢。','<img src="/image/1546406377369935755.jpg">',70),
(NULL,4,'RW000392','张灯结彩','/image/1554356408745376196.jpg',288,'单个花篮','红色扶郎花、粉玫瑰、1支多头粉百合，搭配适量散尾葵、洋兰、栀子叶、朱蕉叶','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于鲜花包扎各地的花艺师不同，可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢。','<img src="/image/1554356408745376196.jpg">',29),
(NULL,4,'RW000366','开张骏业（2个起售）','/image/366_1552639855_62822.jpg',288,'单个花篮','多头粉百合、多头白百合、粉玫瑰、紫色洋桔梗，搭配适量巴西叶、栀子叶、剑兰','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','全国 （可配送至全国1000多个城市，市区免配送费）','由于鲜花包扎各地的花艺师不同，可能在形式和搭配上与图片不完全一致，但保证主花材的新鲜程度、数量、颜色与说明一致，谢谢。','<img src="/image/366_1552639855_62822.jpg">',29),
(NULL,5,'RW000216','海誓山盟','/image/1547803903136862070.jpg',9999,'首席花艺师精选108朵进口永生花玫瑰','高级精品礼盒','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','来自厄瓜多尔的永生玫瑰，是现存世界最巨型的玫瑰，色泽与鲜花无异，是永不凋谢的鲜花。经过109道工序，历时60天的匠心独制，鲜花玫瑰特质完美保留。','<img src="/image/1547803903136862070.jpg">',1000),
(NULL,5,'RW000203','真情不变','/image/203_1547518822_37780.jpg',499,'进口厄瓜多尔玫瑰、进口黑色绣球围绕花朵','高品质精美六角形礼盒搭配精工复古铜牌','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','单位重量1.0 kg 产品体积 28.0 cm * 14.5 cm * 18.0 cm永生花又叫“永不凋谢的鲜花”采用高科技手段，经过脱水、脱色、烘干、染色等一系列复杂工序加工而成的干花，永生花无论是色泽、性状、手感几乎与鲜花无异，它保持了鲜花的特质，且颜色更为丰富、用途更高、保存时间至少3年。','<img src="/image/203_1547518822_37780.jpg">',50), 
(NULL,5,'RW000202','一池柔情','/image/202_1547458075_42703.jpg',499,'进口厄瓜多尔玫瑰花、桑蚕真丝丝巾、进口绣球','独特双开门礼盒搭配俏皮蝴蝶结','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','单位重量1.0 kg 产品体积 13.0 cm * 13.0 cm * 17.0 cm花店首席花艺师纯手工制作永生花，著名设计师款式设计。永生花又叫“永不凋谢的鲜花”采用高科技手段，经过脱水、脱色、烘干、染色等一系列复杂工序加工而成的干花，永生花无论是色泽、性状、手感几乎与鲜花无异，它保持了鲜花的特质，且颜色更为丰富、用途更高、保存时间至少3年','<img src="/image/202_1547458075_42703.jpg">',50), 
(NULL,5,'RW000235','伉俪情深','/image/1548126112378833209.jpg',699,'甄选厄瓜多尔永生玫瑰花头，搭配彩灯，进口拉菲草','高端礼盒精致漂亮，内置彩灯，简约白色pu皮礼盒，搭配烫金色丝带，高端奢华','免费附送精美贺卡，代写您的祝福。(您下单时可填写留言栏)','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','单位重量0.71 kg 产品体积 19.0 cm * 19.0 cm * 14.0 cm甄选厄瓜多尔永生玫瑰花头，36道工艺，手工制作，花材饱满，色泽圆润，内设 抽屉，存放首饰，翻盖后设梳妆镜，方便实用，永生花装饰，可做家居摆件。','<img src="/image/1548126112378833209.jpg">',70),
(NULL,6,'RW000336','婀娜多姿-香薰蜡烛','/image/1550801431116381960.jpg',159,'香薰蜡烛','精致礼盒加精美手提袋','香薰大豆蜡烛 玻璃杯香味蜡烛 伴手礼香薰蜡烛','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','此商品为快递商品，全国统一包邮，请提前3-5天预订！','<img src="/image/1550801431116381960.jpg">',16),
(NULL,6,'RW000326','无火香薰','/image/1550732095564462521.jpg',399,'无','无火香薰精油套装藤条熏香家用卧室内房间香水厕所除臭香薰瓶','无','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','此商品为快递商品，全国统一包邮，请提前3-5天预订！','<img src="/image/1550732095564462521.jpg">',40),
(NULL,6,'RW000335','蔚蓝魅曲-香薰蜡烛','/image/1550800888462719093.jpg',159,'香薰蜡烛','精致礼盒加精美手提袋','无','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','香薰大豆蜡烛 玻璃杯香味蜡烛 伴手礼香薰蜡烛','<img src="/image/1550800888462719093.jpg">',16),
(NULL,6,'RW000344','鼠尾草海盐-香薰蜡烛','/image/1550812960216311349.jpg',199,'香薰蜡烛','精致礼盒加精美手提袋','无','此商品为快递商品，全国统一顺丰包邮，请提前3-5天预订','香薰大豆蜡烛 玻璃杯香味蜡烛 伴手礼香薰蜡烛','<img src="/image/1550812960216311349.jpg">',20);



/*花语文章分类*/
INSERT INTO hz_huayu_category VALUES(NULL,'生日鲜花','birthday'),
																		(NULL,'道歉鲜花','apologize'),
																		(NULL,'情人节','love'),
																		(NULL,'鲜花知识','knowledge');

/*文章页*/
INSERT INTO hz_huayu_articles VALUES(NULL,'老公生日适合送什么鲜花','2020-02-11 10:32:05','&emsp;&emsp;相信许多人在过去在以前，会认为人们经常给女人送花，而给男人送花似乎是个不合适的事情。<strong>老公生日送什么礼物好</strong>？然而，在事实上，它已经被用作各种宴会场合的祝福工具，许多男明星和客人很乐意接受。<br /><br />&nbsp; &nbsp; &nbsp; 送礼指南，什么花适合送你丈夫的生日？这些花是加深感情的必需品。让我们一起来看看艾华菊的花。它是一个初次送几束花给我女朋友是个好主意<strong>老公生日送什么花合适</strong>？别着急跟着Rosewin<strong>鲜花店</strong>一起来往下看答案吧。<br /><p><br /></p><p style="text-align:center;"><img src="image/1581388292_61910.jpg" alt="老公生日送什么花" width="360" height="360" title="老公生日送什么花" align="" /></p><p><br /></p>&nbsp; &nbsp; &nbsp; 蓝色妖姬，相识是一种宿命。在我们心灵的交汇处，我们有着取之不尽的浪漫氛围。秃头总是服务承诺。在这个世界的循环中，我们永远铭记着这个美丽的爱情故事!不是这样吗美丽的比喻是正确的妻子给丈夫的。<br /><br />&emsp;&emsp;<strong>老公生日送什么花</strong>？这些花对加深你的感情。Rosewin为你提供了更多有价值的花卉信息。<br />','image/1581388292_61910.jpg',1),
(NULL,'哥哥生日送什么礼物才合适','2020-01-20 14:47:36','&emsp;&emsp;“我想将全世界漂亮，绚丽，漂亮的花送给扶危济困，不为人知甘于奉献的哥哥，表述我对哥哥的谢谢和景仰之情”见到那样一句话，由不得想到，之前在网上的一个新闻说哥哥停课打工赚钱供侄子亲妹妹上学的感人事迹。<br /><br />&nbsp; &nbsp; &nbsp; <strong>给哥哥送什么生日礼物</strong>、<strong>送哥哥什么生日礼物比较好</strong>？<strong>哥哥生日可以送花吗</strong>？也许那样的工作中没产生在我们的身上，更没产生在我们的身旁，但我们每一次见到那样的工作中的时分，脑海中里都会呈现一副感人肺腑的界面，爱这般简单、打动着真情也是理想。<br /><br />&emsp;&emsp;想起哥哥迅速想起的就是说，有找工作哥哥，被欺负了找哥哥......哥哥在我们的时日中，是一个勇出任，時间照顾我们的角色，那麼我们&emsp;为何不在哥哥生辰，也许工作中得成这些的时分送给哥哥一份礼品，那便是鲜花。<br /><br />&nbsp; &nbsp; &nbsp; 那麼送给哥哥哪些鲜花好？实际上这也要看自身的心意了，花是可以代表者的心意的，无论掏钱花少，自身的心来到就是说开心的。<br /><p><br /></p><p style="text-align:center;"><img src="image/1579502827_39470.jpg" alt="天堂鸟瓶插花" width="360" height="360" title="天堂鸟瓶插花" align="" /></p><p><br /></p>&emsp;&emsp;天堂鸟：潇洒、痴情令郎。你很优秀，吸引了大家眼光，一起又许多情，让很多人 忧伤。好想叫你一声花蓝孔雀，这花的姿态与你很像。<br /><br />&emsp;&emsp;山茶花：深爱、推让、理想的爱、不得了的风采。较为像传统式的在我国男人，有较为像英国绅士，无论像谁你全是很有风采的人。<br /><br />&emsp;&emsp;香石竹：热情。热情的善人，急事的时分，一直不顾一切的冲锋在前。付款却无求回报，善良的你确实很适合香石竹。<br /><br />&emsp;&emsp;百合花：执着的爱、勇敢。这类男人很*该器重，有时分就算碰到曲折，依然很坚强勇敢，不抛下期待。<br /><br />&emsp;&emsp;火鹤花：<strong>哥哥生日送什么花</strong>？火鹤花也就是人们现在所说的红掌花，红掌花的含义是大展鸿图、热情、激情。可以送给工作中正处在生机勃勃阶段，准备大干一场一场盆友。此时的他如同火鹤花同样一腔热血、激情四射。<br />','image/1579502827_39470.jpg',1),
(NULL,'暗恋的女孩过生日送什么礼物好','2020-01-19 15:09:36',' &emsp;&emsp;暗恋的女生生日送什么礼品较为好?这一全世界真心实意、清洁、令人辛酸的感情就是说暗恋。静静的高度重视一个人，静静的盼望一份也许永久性也不容易到来的感情，不愿让另一方了解也不愿对大家公布。<br /><br />&nbsp; &nbsp; &nbsp; 它是一份沒有回荡的感情、无求回报、朝思暮想地期待暗恋的人可以兴高采烈时日。<br /><br />&nbsp; &nbsp; &nbsp; <strong>给暗恋的女孩送什么生日礼物好</strong>、<strong>暗恋的女孩生日送什么</strong>、<strong>暗恋的女孩生日送什么花</strong>、<strong>暗恋的女孩过生日送什么礼物好</strong>：<br /><br />&nbsp; &nbsp; &nbsp; 暗恋一个人可又没胆量去表述，或是是表述的机会还不老练，该如何去表述内心的情意?自然送花是好的选择，但是即然是暗恋，送花也有独特，选既可以表述倾慕之意又低调的花是好的。送她(他)一束花。满天星、百合花、向日葵花全是喻意暗恋的花。<br /><br />&emsp;&emsp;满天星：内涵真诚的喜爱、关爱、童真，及其甘为副角。用红色玫瑰配制满天星说明“十分偏爱”。满天星的珍珠白中合了红色玫瑰的火爆、让整束花气场趋向沉稳、决不对于莽撞。<br /><br />&emsp;&emsp;小苍兰<br /><br />&emsp;&emsp;<strong>小苍兰的花语</strong>：童真、情浓、芳香<br /><br />&emsp;&emsp;人贵有德、花贵有香，花姿雅致悦耳的小苍兰、芳香雅致，其浓厚的香气，十分得人喜爱，可以说醇而不浊、清而不油腻，非常晚间香气更浓。芬芳色艳的小苍兰无论是做花束或盆栽植物送人全是极好的花礼。<br /><p><br /></p><p style="text-align:center;"><img src="image/1579417737_73910.jpg" alt="满天星花束" width="360" height="360" title="满天星花束" align="" /></p><p><br /></p>&emsp;&emsp;向日葵<br /><br />&emsp;&emsp;<strong>向日葵的花语</strong>：缄默恬静的爱<br /><br />&emsp;&emsp;向日葵的寓意是信念、光辉、高傲、忠诚、钦慕，向日葵的寓意是缄默恬静的爱，意味着着英勇地去寻找自身要想的幸福。向日葵花别号太阳光花别名朝阳花，因头状花序随太阳光翻转而出名。老话独特的向日葵花，可是拥有许多传说故事。<br /><br />&emsp;&emsp;雏菊花<br /><br />&emsp;&emsp;<strong>雏菊花的花语</strong>：暗恋你、你爱不爱我?藏身心里的爱<br /><br />&emsp;&emsp;拥有小小的白色花朵的雏菊也有着三种不一样的实际意义。初种是永久性的开心，传说故事山林中的妖怪贝尔蒂丝就是说变为雏菊，她是个栩栩如生开心的孩子;第二种是你爱不爱我?因此雏菊一般是暗恋者送的花;第三种则是--别离。<br /><br />&nbsp; &nbsp; &nbsp; 也有一种雏菊的花语也是坚强的含意，说明开心、幸福、童真、单纯、平静、期待、丽人、栩栩如生。<br />     ','image/1579417737_73910.jpg',1),
(NULL,'送妈妈生日的花应该送什么好','2020-01-17 16:16:51','&emsp;&emsp;无论人们处于人生道路的什么环节，都是还记得母亲让我们做生日的花香。一碗长寿面、一个荷包蛋，都蕴含着母亲对子女的爱和祝福。送给妈妈的生日礼物可以是哪些呢？<strong>送给妈妈的生日礼物有哪些</strong>？Rosewin<strong><a href="idnex.html" target="_blank">鲜花店</a></strong>小编今天就给大家讲解相关知识。<br /><br />&emsp;&emsp;母亲做生日对许多 人而言，尤其太远的中央政府每日任务的子孙后代不可以长伴母亲膝前，甚至在母亲做生日的时段也不可以赶归去，但又务必让母亲感受感柒我们的爱情、谢谢和祝福，这种时段买花送花就是说好的方式了。<br /><br />&emsp;&emsp;平常以一朵朵的康乃馨做为赠给母亲的花。能够送乳白色、粉色。康乃馨的逐层花朵代表母亲对子孙后代绵绵不绝时常的心态。<br /><p><br /></p><p style="text-align:center;"><img src="image/1579248992_51094.jpg" alt="康乃馨精美花盒" width="360" height="360" title="康乃馨精美花盒" align="" /></p><p><br /></p>&nbsp; &nbsp; &nbsp; 也可以加一些百合花。而且康乃馨都是母亲之花，粉色的康乃馨更拥有 祝福母亲永久性五彩缤纷年青有活力的含意，通俗化乳白色康乃馨是用于祝福母亲健康长命，因而今时生辰送什么花好，康乃馨虽然是起首啦!<br /><br />&emsp;&emsp;无论什么年事的女性都喜好粉色的花束，因此说母亲生辰送什么花好，一朵朵粉色的香石竹做为赠给母亲的花就是说十分非常好的挑选哦。粉色是女士的颜色，香石竹的逐层花朵代表母亲对子孙后代绵绵不绝时常的心态。<br /><br />&nbsp; &nbsp; &nbsp; <strong>送给妈妈的生日礼物有什么</strong>？<strong>送妈妈生日的花应该送什么好</strong>？送花时应送一只也应送数枝组成的鲜花花束，或制成优美新奇的艺术插花。母亲节能够送22朵，也可以送17朵、33朵、53朵、实际上母亲节送几枝康乃馨实际上不关键，关键的就是你送花的情谊。<br /><br />&emsp;&emsp;仍以一朵朵粉色的香石竹做为赠给母亲的花。粉色是女士的颜色，香石竹的逐层花朵代表母亲对子孙后代绵绵不绝时常的心态。送花时既应送一只也应送数支组成的鲜花花束，或制成外观优美新奇的艺术插花。<br /> ','image/1579248992_51094.jpg',1),
(NULL,'惹女朋友生气送什么花哄她开心','2020-01-17 16:15:38','&emsp;&emsp;鲜花不仅可以用于祝福，都是调整情感的武器。分歧不久发病，急着碰面解說反倒将会让事儿变得越来越槽糕，如果可以用一束花的方式表述歉疚，另一方看见鲜花心情很大，趁便自身也理智地考虑一下，怨恨也许就消除没了。<br /><br />&emsp;&emsp;给女友抱歉送花，按照海外的老规矩一般是送黄色玫瑰花的，但是都没有必需非得送黄色的玫瑰花，总之是哄女朋友开心嘛。<br /><p><br /></p><p style="text-align:center;"><img src="image/1579248918_52648.jpg" alt="黄玫瑰" width="360" height="360" title="黄玫瑰" align="" /></p><p><br /></p>&nbsp; &nbsp; &nbsp; <strong>惹女友生气送什么花</strong>？去<strong>鲜花店</strong>看一下送香槟色、粉色、乳白色等也全是可以的。关键的是送花这一全过程，而并不是详尽的花非如果哪些，自然也可以根据女性的钟爱来选择花材，倘若女孩较为钟爱新鮮得话，可以送百合花、非洲菊等非常的花材。<br /><br />&emsp;&emsp;<strong>惹女友生气了该送什么花好</strong>？<strong>惹女友生气送什么鲜花表达歉意</strong>？花送的情意无论送什么样的玫瑰花，坚信女友都是心情很大，但是抱歉送花终究是亡羊补牢，比不上平常多送花，惹她发火了，她念着你的好，这一时段不送花就能解决困难。<br />','image/1579248918_52648.jpg',2),
(NULL,'向爱人道歉送花送几朵花','2020-01-17 15:55:02','&emsp;&emsp;做错事的男生送一束诱惑的鲜花为自己的爱人，日子中我们都会因为一些片面性也许客观性的难题而让我们的爱人气愤。<br /><br />&nbsp; &nbsp; &nbsp; 这一时段做为她们的男友也许丈夫，我们不顾一切的就要求对她们开展宽慰和抱歉了。但是有时候光度计是语言将会并沒有方式 将她们的怒气清除，因此好的方式 就是说选购一些小礼品给他为好，而鲜花就是说礼品中的一大选择。<br /><br />&emsp;&emsp;本人可以在人海茫茫碰到而且来到一起，那所借助的并不是仅仅 虚幻的缘份而已。也有那一路走来所经验的艰苦艰难困苦。每一对爱人全是根据耐久度的磨合期才可以真正的日子在一起的。而这并非说白了的一加一相当于二的公式计算。只是零点五加零点五相当于一的等式。<br /><p><br /></p><p style="text-align:center;"><img src="image/1579247656_66880.jpg" alt="19朵黄玫瑰" width="360" height="360" title="19朵黄玫瑰" align="" /></p><p><br /></p>&nbsp; &nbsp; &nbsp; <strong>向爱人道歉送什么礼物好</strong>、<strong>向爱人道歉送什么花适合</strong>？要是我们真正的丢掉了一些日子中不应当具备的不良习惯和坏个人行为才可以过上好日子完满的日子。假设一位的只惦记着自身过的怎么样，那麼必定会来到隔开的那一天。<br /><br />&nbsp; &nbsp; &nbsp; 非常是一些正处于磨合的情侣，经常会因为一些琐事而产生矛盾，而这种实际上是每一对夫妻都是经验的事。气愤是一切正常的，但是气愤以后我们所需应对的就是说解决困难了。而解决困难的标准就是说心平气和的沟通交流。<br /><br />&nbsp; &nbsp; &nbsp; 鲜花就是说可以让我们的女友静下心来的一个非常好的序言。一起根据赠予自身女友漂亮诱惑的花，不仅仅 可以让另一方体会到自身的抱歉，还可以表述出自身对另一方的在意和心灵深处浓浓情意。<br /><br />&emsp;&emsp;<strong>向爱人道歉送什么花</strong>？<strong>向爱人道歉送几朵花</strong>？而赠给自的爱人代表抱歉的鲜花好就是说可以选择黄玫瑰。因为黄玫瑰所代表的花的寓意就是说抱歉，抱歉。根据黄玫瑰可让另一方了解你已经了解来到自身的过失而且期望获得另一方的宽容。<br />','image/1579247656_66880.jpg',2),
(NULL,'跟女朋友道歉送什么花比较好','2020-01-16 15:00:51','&emsp;&emsp;两团体在一同还是夙夜早晚相处，没有磕磕碰碰那是不能够的，没有相互气愤过这话你要敢说我就敢不信。惹女朋友气愤了，那就不只需检查更要抱愧了。因为她又看不到你的心，看不到你的悔意，这就要你表现出来。<br /><br />&emsp;&emsp;<strong>跟女朋友道歉送什么礼物</strong>，<strong>跟女朋友道歉送几支黄玫瑰</strong>？抱愧的方法有很多，送花是其间的一种，还是比拟有效的一种。女性嘛通俗都爱好鲜花，看到鲜花那还不大年夜事化小、大年夜事化了。可以送女朋友代表抱愧的黄玫瑰，也能够送女朋友表达爱意的红玫瑰、粉玫瑰等。<br /><p><br /></p><p style="text-align:center;"><img src="image/1579157968_51847.jpg" alt="19朵黄玫瑰" width="360" height="360" title="19朵黄玫瑰" align="" /></p><p><br /></p>&emsp;&emsp;跟女朋友冷战想道歉送花送多少朵适宜?抱愧送花可以送50朵、22朵、33朵、9朵。其实不论送多少朵花，主要的是情意，让女朋友感触感染到你抱愧的诚恳才是重点。Rosewin<strong><a href="https://www.huazan.com/" target="_blank">鲜花店</a></strong>小编整顿了几款抱愧花款，欲望能帮到您。<br /><br />&emsp;&emsp;<strong>跟女朋友道歉送什么花</strong>？跟女朋友冷战想道歉送花送多少朵合适？在恋爱和婚姻里边分的不满是对错，而是爱有多深、爱有多真。抱愧如何能连一束抱愧的花都没有?要知道一束抱愧的花，再加上十分仔细的心情，很能够完成大年夜逆转，反而让恋爱升温。抱愧送花尽在Rosewin。<br />      ','image/1579157968_51847.jpg',2),
(NULL,'给女朋友道歉送花送多少多合适','2019-12-23 15:04:08',' &nbsp; &nbsp; &nbsp; 相信在许多男生们的眼中，女朋友的心总是难以捉摸的，不是有这么一句话吗，女人心海底针，有时候不知道什么情况不知道自己做了什么事情就惹对方生气了不开心了。谄谀女朋友可不是那么轻易的，需求采取各类方法和手腕，比如送花。<br /> <br /> &emsp;&emsp;<strong>送女朋友鲜花多少价位的比较好</strong>？<strong>情侣道歉送花送多少朵</strong>？其实讨女朋友高兴，关键不是看买花时选择的鲜花价格，而是你选择的花种类和你在送花时的各类准备和小技能。花的选择多半都是玫瑰花，不外依据女友的性情不同，选择的鲜花不同。<br /> <p> <br /> </p> <p style="text-align:center;"><img src="image/1577084611_66092.jpg" alt="19朵粉玫瑰" width="360" height="360" title="19朵粉玫瑰" align="" /></p><p><br /></p>&emsp;&emsp;送女朋友鲜花必然也分不同的状况吧!假设是在女友生日的时候送花，选择一束11朵百合花比较好。假设是表达或许求婚，可以选择99朵或许100度百合花，宣誓欲望牵手一生的许诺。<br /><br />&emsp;&emsp;<strong>道歉订花送花服务</strong>、<strong>向女朋友道歉送花</strong>，在这里Rosewin花店小编要给大家提醒的是，送女朋友花的时候可以提早先弄清晰女朋友的喜好，在花的设计搭配上加上一些对方爱好的元素，置信也会是不错的选择。<br /><br />&nbsp; &nbsp; &nbsp;&nbsp;鲜花配送-Rosewin花店,专业提供网上订花,专注于鲜花订购服务,3小时左右可将新鲜的花以高品质的服务送花上门。<br />','image/1577084611_66092.jpg',2),
(NULL,'情人节送女友几朵花','2020-02-10 15:20:36','&emsp;&emsp;情人节是全世界相爱的人的假期。在这一天，空气似乎充满了温暖和甜蜜。您如何在流行病中度过情人节?多少花适合情人节?情人节精美鲜花交付更加安全。我们来看看Rosewin999玫瑰花了多少钱，以及情人节要送什么花。<br /> <br /> &emsp;&emsp;<strong>情人节一般送几朵花</strong>？<strong>情人节送女孩几朵花</strong>？情人节*常用的礼物是玫瑰，百合，太阳花，金莺，可以仔细地将其转变成为亲人的精美礼物。送花时，必须送一大束花。你送几束花?你是什么意思颜色可以根据她的气质来选择。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1581319196_42695.jpg" alt="19朵粉玫瑰" width="360" height="360" title="19朵粉玫瑰" align="" /> </p> <p> <br /> </p> &nbsp; &nbsp; &nbsp; 因为这是初次送花，所以不要买热的红玫瑰，重要的是要购买女孩喜欢的花。<br /> <br /> &nbsp; &nbsp; &nbsp; <strong>情人节送女友几朵花</strong>？有白玫瑰，香槟玫瑰，粉红玫瑰和紫色玫瑰。 9朵花，11朵花，13朵花，18朵花，19朵花，33朵花等都有很好的含义。以玫瑰为基础，可与百合，桔梗，李子小姐，星空，牡丹一起使用。<br /> <br /> &emsp;&emsp;情人节精美鲜花交付更加安全，Rosewin为您提供更多有价值的鲜花信息。<br />','image/1581319196_42695.jpg',3),
(NULL,'情人节送女朋友多少朵花才更加的浪漫呢？','2020-02-10 14:46:19','&emsp;&emsp;情人节通常是关爱他人的假期，这一天空气充满了温暖的甜蜜。将其发送给那些热爱鲜花的人，并将*深的爱和爱与他们的心灵联系起来。<br /> <br /> &nbsp; &nbsp; &nbsp; <strong>情人节送女朋友多少花</strong>？<strong>情人节送什么给女朋友</strong>？<strong>情人节送女朋友什么浪漫</strong>？情人节即将宠爱女友。让我们来看看如何用爱花菊在不同的地方订购鲜花和玫瑰。让我们推荐一下情人节会送多少花。<br /> <br /> &emsp;&emsp;情人节那天的男孩甚至还给女孩送了其他礼物，玫瑰是必不可少的，玫瑰的数量非常谨慎。<br /> <br /> &nbsp; &nbsp; &nbsp; 1朵玫瑰是我唯一的玫瑰，2朵玫瑰在这个世界上只有我们两个，3颗我爱你，4颗无尽的爱，5颗没有怨恨和遗憾，6颗相互尊重，互爱，相互理解，7颗初恋，8颗感谢，9个持久，10个完美和完美，以及11个永远爱你。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1581317145_59169.jpg" alt="16朵白玫瑰" width="360" height="360" title="16朵白玫瑰" align="" /> </p> <p> <br /> </p> &nbsp; &nbsp; &nbsp; 19朵花意味着爱情是永恒的，是爱情的*高峰。在这里，有一个新的解释，即，如果您将19分解为19=11 +1 + 2 + 5则N，那么它的花朵的道德含义将变为yes-我只会爱你一生+您是我。只有+整个世界才能只有我和您+生活无悔。<br /> <br /> &emsp;&emsp;情人节是为了宠爱你的女友，而Rosewin<strong>鲜花网站</strong>就为您提供了更多有价值的鲜花信息供你了解查询。<br />','image/1581317145_59169.jpg',3),
(NULL,'情人节送老公什么礼物合适？','2020-02-10 14:44:59',' &emsp;&emsp;说到鲜花，人们认为很多人首先想到给女人，但是鲜花是我们情感的载体，鲜花是美好事物的象征，所以没有人喜欢鲜花，包括男人。所以说鲜花在现在生活中的许多节日和纪念日里面是一个非常重要的角色。<br /> <br /> &nbsp; &nbsp; &nbsp; <strong>情人节送老公什么花</strong>？<strong>情人节送老公什么花更有寓意</strong>？让我们看一下Rosewin<strong>鲜花网站</strong>*近给大家推荐的花店和11个蓝色恶魔女孩的地址，并在情人节为您的丈夫推荐一朵花。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1581317072_94086.jpg" alt="向日葵抱抱桶花" width="360" height="360" title="向日葵抱抱桶花" align="" /> </p> <p> <br /> </p> &emsp;&emsp;<strong>情人节送老公什么礼物</strong>？<strong>情人节送老公什么礼物合适</strong>？在情人节那天，您可以考虑将香槟玫瑰，白玫瑰和蓝玫瑰发送给您的丈夫。通常，情人节鲜&emsp;花递送主要表达爱与美丽的含义。玫瑰是必不可少的。<br /> <br /> &nbsp; &nbsp; &nbsp; 通常，丈夫会送花。购买鲜花时，他们会根据自己的经济状况选择1、9、11、19、33、99甚至999朵鲜花，详细发送几朵。如果期望很高，当然，越多越好，如果您希望源源不断，那么每周也可以这样做。<br /> ','image/1581317072_94086.jpg',3),
(NULL,'情人节订花需要提前几天去预订呢？','2020-01-27 15:00:01','&nbsp; &nbsp; &nbsp; 每年的情人节都是玫瑰花傲娇的时候，你想提前预订是一个很好的做法，但是你要想当天预订，那可就错了。情人节当天预订玫瑰花的人太多了，花店的供应量都不够。考虑到这样的原因，今年情人节一定要提前订花，预订玫瑰花需要提前几天比较好?Rosewin <strong><a href="index.html" target="_blank">凤台县鲜花店</a></strong>小编马上给您解答。<br /> <br /> &emsp;&emsp;<strong>情人节送什么花合适</strong>?情人节预订玫瑰花需要提前几天比较好?今年网络情人节自5月10号左右开始节日氛围就比较浓烈了，各大电商和各大品牌都是开始围绕情人节这个专题来做文章了，订花的人就相继增多。预定玫瑰建议提前一周会比较合适。不用担心花店没有存货而且这个时候正是花店人员进货的时期、花店存货很充足。而且很重要的一点是你提前预订的花可以在节日当天给你提前送达。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1579573489_63432.jpg" alt="绿玫瑰抱抱桶" width="360" height="360" title="绿玫瑰抱抱桶" align="" /> </p> <p> <br /> </p> &emsp;&emsp;Rosewin是一家经营全国范围内鲜花预订、鲜花配送、异地送花服务的专业花店。全国500多家自营花店、规模比较大，有充足的人员支持鲜花派送，在鲜花行业中已经有比较一定知名度。情人节的玫瑰花均是统一从云南花卉基地采摘，空运至各大门店，优质天然的花材，朵朵天然饱满送人。<br /> <br /> &nbsp; &nbsp; &nbsp; 点击链接：<a href="index.html" target="_blank"><u>首页</u></a> 进入Rosewin<strong>鲜花订购</strong>您心仪的<strong>鲜花</strong><br /> <br /> &emsp;&emsp;<strong>情人节送什么花好</strong>?情人节玫瑰花逐渐走俏，在情人节当天玫瑰花价格高。所以情人节想要送花还需提前预订哦。<br /> ','image/1579573489_63432.jpg',3),
(NULL,'普通异性朋友送什么花','2020-02-11 10:36:39','&emsp;&emsp;花子不仅可以送给她的父母，也可以送给普通的朋友或普通的异性恋者朋友。花代表美丽和祝福。给朋友的花也代表着我们的美丽祝福。为好朋友挑选的花一定要注意花的种类挑选和颜色的选择。<br /> <br /> &nbsp; &nbsp; &nbsp; <strong>朋友生日送什么样的花</strong>？<strong>送普通朋友什么花好</strong>？<strong>普通异性朋友送什么花</strong>？送花体现了你的高情商，就算再远方的朋友也可以送花过去联系之间的友情。接下来一起来和Rosewin<strong>鲜花网站</strong>看看为普通朋友推荐给朋友送什么话吧。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1581388541_71713.jpg" alt="向日葵花束" width="360" height="360" title="向日葵花束" align="" /> </p> <p> <br /> </p> &emsp;&emsp;<strong>普通朋友送什么花</strong>？如果你是异性恋朋友，送一束花。花儿不应该太贵。你不能送玫瑰。你不能送百合等玫瑰。星星是纯粹的。你还要别的吗?姑娘们多大了，要送多少字，比如向日葵和小的新鲜花束都不错。<br /> <br /> &nbsp; &nbsp; &nbsp; 不要太大气，要漂亮和普通的花，送一对花反映你高情商。Rosewin<strong>鲜花店</strong>为您提供了更多有价值的花卉信息。<br />','image/1581388541_71713.jpg',4),
(NULL,'看望刚生完孩子的产妇送什么花','2020-02-10 14:47:34','&emsp;&emsp;生命的诞生意味着新希望的到来，孩子的诞生为母亲带来幸福和活力。参观这些鲜花既讨人喜欢又负担得起。让我们一起来看看Rosewin<strong>鲜花店</strong>的推荐的花朵吧。初次送几朵花给我的女朋友是个好主意。<br /> <br /> &emsp;&emsp;<strong>看望产妇送什么好</strong>？<strong>给产妇送什么礼物好</strong>？<strong>刚生完孩子的产妇送什么礼物好</strong>？怀孕十月，即孕妇出生的那一天，母亲可能是*痛苦的。尝试从母亲的角度选择这束花。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1581317234_16759.jpg" alt="粉色康乃馨" width="360" height="360" title="粉色康乃馨" align="" /> </p> <p> <br /> </p> &nbsp; &nbsp; &nbsp; 建议将鲜花送给脆弱的母亲和一束温和，清新的花束。像粉红色一样，暖粉色可以帮助母亲轻柔地照顾婴儿。<br /> <br /> &nbsp; &nbsp; &nbsp; 为了交付孕妇鲜花，味道需要更加优雅。不要散发太浓的香气，如香水百合等，刚生完孩子后，身体非常虚弱，闻到的香气会更不舒服，新生婴儿更敏感，受不了了味道。<br /> <br /> &emsp;&emsp;<strong>送什么花给刚当上妈妈的人呢</strong>？<strong>看望刚生完孩子的产妇送什么花</strong>？拜访刚生完宝宝的母亲时，千万要注意这些花朵令人赏心悦目且负担得起,Rosewin鲜花网站为您提供更多有价值的花卉信息。','image/1581317234_16759.jpg',4),
(NULL,'白车轴草的花语和传说','2020-01-29 15:00:01','&emsp;&emsp;白车轴草，姓名实际上有点儿生疏对吗?可是实际上它就是说三叶草，都是人们经常说的幸运草。生态公园花苑马路边都很普遍，也是许多爱花之人在家中当盆栽植物养。由于它的花的寓意真的是太多寓意了。<br /> <br /> &nbsp; &nbsp; &nbsp; 三叶草的植物不仅仅是酢浆草科的酢浆草，还有豆科的车轴草和苜蓿草。其中白花车轴草，被爱尔兰用作自己的国花。<br /> <br /> &nbsp; &nbsp; &nbsp; <strong>白车轴草的花语</strong>：<br /> <br /> &nbsp; &nbsp; &nbsp; 为爱国. 幸运草，这三种植物都有四片叶子的变异情况出现，概率大概是十万分之一。<br /> <br /> &emsp;&emsp;白车轴草的花的寓意人们经常授予一些盆栽花卉独特的含意，可是一般是一种花一个花的寓意。而白车轴草。也就是说三叶草，确是每一片叶子常有一个花的寓意。三叶草，一片叶子意味着祈祷，一片叶子意味着期待，一片叶子意味着感情，而较难追寻的四叶草的*终一片叶子代表着幸福快乐。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1579574127_22019.jpg" alt="白车轴草的花语" width="360" height="360" title="白车轴草的花语" align="" /> </p> <p> <br /> </p> <p> &nbsp; &nbsp; &nbsp; <strong>白车轴草的传说</strong>： </p> <br /> &nbsp; &nbsp; &nbsp; 谁找到四叶草，谁就是说*幸运的人，能得到幸福快乐。白车轴草的传说故事在西方国家许多國家(如美国、英国)长有四片叶片的三叶草(即四叶草)意味着着好运，由于它被觉得是只能在梦幻岛中才有的绿色植物。而在一些國家里，扑克游戏里边的红梅花就是说意味着好运的三叶草。<br /> <br /> &nbsp; &nbsp; &nbsp; 假如谁找到有四瓣叶片的三叶草，即四叶草(也称幸运草)，谁就会获得幸福快乐。<br /> <br /> &nbsp; &nbsp; &nbsp; 因此在欧州一些國家，在马路边见到三叶草的大家，基本上都是把它放好，摊平，便于来日赠予别人，为此来表述她们对朋友的幸福预祝。在西班牙，每一年的3月17日的圣巴特里克节上，每个人要戴上一个三叶草花球。听说，圣巴特里克曾以一片三叶草向尊崇随意的爱尔兰人解读三位一体。<br /> <br /> &nbsp; &nbsp; &nbsp; 当时圣巴特里克用于形容的到底是三叶草還是红花的湖蓝草了。但是，三叶草确是典型性的为天主教所承继的一种代表。<br /> <br /> &emsp;&emsp;它很早以前就是说凯尔特人三个祭师级别三级一体的代表。而三叶草那朝气蓬勃的涨势也使它变成活力的代表。德鲁伊早就授予了四叶三叶草与今日同样的实际意义了，那便是幸福快乐。<br />','image/1579574127_22019.jpg',4),
(NULL,'网上订花靠谱的网站有哪些呢','2020-01-26 15:00:01',' &nbsp; &nbsp; &nbsp; 随着近几年的各大电商平台的兴起和快速发展，现在连订购一束花都可以在网上购买了，网上订花平台这么多，平台之间的质量也是良莠不齐。消费者在网上订花的时候内心都会有个疑问，<strong>网上订花哪个网站好</strong>?Rosewin <strong><a href="index.html" target="_blank">潘集区鲜花店</a></strong>小编马上给你答案。<br /> <br /> &emsp;&emsp;网上订花要从多个角度去考虑，不能忙碌贪图鲜花价格低的网站。让消费者担心的问题，主要是品质问题、速递服务、配送费怎么算。<br /> <br /> &emsp;&emsp;1、鲜花品质问题<br /> <br /> &emsp;&emsp;有没有网上订花的网站，担心收到的表面花有污渍，还担心花材不够新鲜。Rosewin花店的花材均从云南花卉基地采摘。当天采摘后会通过空运方式输送至Rosewin全国线下花店。在输送过程中全程采用严密的保鲜措施、保证花材无污染无破损。<br /> <p> <br /> </p> <p style="text-align:center;"> <img src="image/1579573187_84518.jpg" alt="白玫瑰花束" width="360" height="360" title="白玫瑰花束" align="" /> </p> <p> <br /> </p> &emsp;&emsp;2、鲜花速递服务<br /> <br /> &emsp;&emsp;花的保鲜时间很短，收到不新鲜的花也就失去了送花的意义了。消费者在Rosewin官网上下单后，立即会由距离收花人近的Rosewin实体花店进行包扎配送、专人负责准时送花上门。为消除消费者的顾虑、还支持货到付款服务。<br /> <br /> &emsp;&emsp;3、配送费怎么算<br /> <br /> &emsp;&emsp;在网购的时候很多东西都会有配送费加上配送费，实际支付的价格也不低哦!所以消费者更偏爱免费配送的订花网站。在Rosewin网上下单后，系统会自动匹配到距离送花人所在城区的花店，同城配送零运费、鲜花性价比是不是超高呢，这些问题要考虑到。<br /> <br /> &emsp;&emsp;<strong>网上订花鲜花店哪个网站好</strong>?<strong>网上订花哪个网站好</strong>?从上面上个方面来考虑，首选的还是Rosewin哦!想要快速订到自己喜欢的花。<br />','image/1579573187_84518.jpg',4);
/*用户*/
INSERT INTO hz_user VALUES(NULL,'dangdang','123456','dang@126.com','18112345678','/image/1.jpg','当当','1'),
                          (NULL,'dingding','654321','ding@qq.com','15198765432','/image/1.jpg','钉钉','0');